app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'kepsek1'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $model = new Users();
        $log_activities = new LogActivities();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $data = $model->where('username', $username)->first();