app/Controllers/EvaluationController.php

SELECT *
FROM `questions`
SELECT *
FROM `options`
WHERE `question_id` = '23'
---
    public function create($errorMessage = '')
    {
        $data['error_message'] = $errorMessage;
        $questions = $this->db->table('questions')->get()->getResult();
        $data['questions'] = array();
        foreach ($questions as $key) {
            $new_array = array();
            $new_array['id'] = $key->id;
            $new_array['question'] = $key->question;
            $new_array['options'] = $this->db->table('options')->where('question_id',$key->id)->get()->getResult();

SELECT *
FROM `bookmarks`
JOIN `users` ON `bookmarks`.`user_id` = `users`.`id`
WHERE `bookmarks`.`school_id` = '1'
---
    public function getData(){
        $request = Services::request();
        $datatable = new EvaluationDatatable($request);

        if ($request->getMethod(true) === 'POST') {
            $lists = $datatable->getDatatables();
            $data = [];
            $no = $request->getPost('start');

            foreach ($lists as $list) {
                $pengawas = $this->db->table('bookmarks')->join('users','bookmarks.user_id = users.id')->where('bookmarks.school_id',$list->school_id)->get()->getResult();