app/Controllers/QuestionController.php

    public function store()
    {
        $validation =  \Config\Services::validation();
        $question = new Questions();
        $option_model = new Options();
        $validation->setRules(['val-question' => 'required', 'val-option' => 'required']);
        // dd($this->request->getPost('val-option'));
        $isDataValid = $validation->withRequest($this->request)->run();
        // dd($isDataValid);
        if (!$isDataValid) {
            $errorMessage = 'Input is Required';
        }


        // jika data valid, simpan ke database
        if($isDataValid){
            $question->insert([
                "question" => $this->request->getPost('val-question')
            ]);
            $question_id = $question->getInsertID();
            $options = $this->request->getPost("val-option['option']");
            for ($i=0; $i<count($options); $i++ ){
                $option_model->insert([
                    'question_id' => $question_id,
                    'option' => $this->request->getPost("val-option['option'][$i]"),
                    'score' => $this->request->getPost("val-option['score'][$i]"),
                    'notes' => $this->request->getPost("val-option['notes'][$i]"),
                ]);
---
INSERT INTO `questions` (`question`) VALUES ('Bagaimana perkembangan para murid di sekolah ?')
INSERT INTO `options` (`question_id`, `option`, `score`, `notes`) VALUES (29, 'baik', '10', '<p>test</p>')

    public function view($id){
        $question = new Questions();
        $options = new Options();
        $data['data']['question'] = $question->find($id);
        $data['data']['options'] = $options->where('question_id',$id)->get()->getResult();
---
SELECT *
FROM `questions`
WHERE `questions`.`id` = '29'
SELECT *
FROM `options`
WHERE `question_id` = '29'