app/Models/EvaluationDatatable.php

SELECT COUNT(*) AS `numrows`
FROM `evaluations`
JOIN `schools` ON `evaluations`.`school_id`=`schools`.`id` and `schools`.`id`=1
JOIN `users` ON `evaluations`.`user_id`=`users`.`id`
JOIN `criterias` ON `evaluations`.`criteria_id`=`criterias`.`id`
---
    public function countFiltered()
    {
        $school_id = $this->session->get("school_id");

        $level = $this->session->get("level");
        if ($level == 1 || $level==3) {
            $this->dt = $this->db->table('evaluations')->join('schools',"evaluations.school_id=schools.id")->join('users','evaluations.user_id=users.id')->join('criterias','evaluations.criteria_id=criterias.id')->select('evaluations.id, evaluations.school_id, evaluations.user_id, evaluations.date, evaluations.score, evaluations.criteria_id, schools.schoolname, users.fullname, criterias.notes, evaluations.year');
        }else{
            $this->dt = $this->db->table('evaluations')->join('schools',"evaluations.school_id=schools.id and schools.id=$school_id")->join('users','evaluations.user_id=users.id')->join('criterias','evaluations.criteria_id=criterias.id')->select('evaluations.id, evaluations.school_id, evaluations.user_id, evaluations.date, evaluations.score, evaluations.criteria_id, schools.schoolname, users.fullname, criterias.notes, evaluations.year');
        }
        $this->getDatatablesQuery();
        return $this->dt->countAllResults();

SELECT COUNT(*) AS `numrows` FROM `evaluations`
---
    public function countAll()
    {
        $school_id = $this->session->get("school_id");

        $level = $this->session->get("level");
        if ($level == 1 || $level==3) {
            $this->dt = $this->db->table('evaluations')->join('schools',"evaluations.school_id=schools.id")->join('users','evaluations.user_id=users.id')->join('criterias','evaluations.criteria_id=criterias.id')->select('evaluations.id, evaluations.school_id, evaluations.user_id, evaluations.date, evaluations.score, evaluations.criteria_id, schools.schoolname, users.fullname, criterias.notes, evaluations.year');
        }else{
            $this->dt = $this->db->table('evaluations')->join('schools',"evaluations.school_id=schools.id and schools.id=$school_id")->join('users','evaluations.user_id=users.id')->join('criterias','evaluations.criteria_id=criterias.id')->select('evaluations.id, evaluations.school_id, evaluations.user_id, evaluations.date, evaluations.score, evaluations.criteria_id, schools.schoolname, users.fullname, criterias.notes, evaluations.year');
        }
        $this->getDatatablesQuery();
        return $this->dt->countAll();