app/Models/LogActivities.php

    public function insert_log($data){
        $query = $this->insert($data);
---
INSERT INTO `log_activities` (`tables_name`, `description`, `before`, `after`, `create_date`, `create_by`, `active`) VALUES ('evaluations', 'Access form Evaluation', '', '', '2024-03-01 05:00:39', '6', 1)