app/Models/QuestionDatatable.php

SELECT COUNT(*) AS `numrows` FROM `questions`
---
    public function countFiltered()
    {
        $this->getDatatablesQuery();
        return $this->dt->countAll();

SELECT COUNT(*) AS `numrows`
FROM `questions`
---
    public function countAll()
    {
        $tbl_storage = $this->db->table($this->table);
        return $tbl_storage->countAllResults();