app/Views/dashboard.php

$awal_tahun = date('Y-m-01');
$now = date('Y-m-d');
if ($awal_tahun == $now) {
    $db->table('users')->update([
        'first_login' => 1
    ]);
---
UPDATE `users` SET `first_login` = 1